---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.ClipPlane
source: html/ebd83d06-6cd2-b8f1-4493-7e8ef7b499a7.htm
---
# ClipPlane Properties

Specifies whether the .NET object represents a valid Revit entity.